# -*- coding:utf-8 -*-
"""
Розробити функцію make_sudoku(size),
яка приймає 1 аргумент -- додатнє ціле число (1 <= size <= 42),
та повертає список списків -- квадратну матрицю, що представляє
судоку розмірності size.

Судоку розмірності X являє собою квадратну матрицю розмірністю X**2 на X**2,
розбиту на X**2 квадратів розмірністю X на X, заповнену цілими числами таким чином,
щоб кожна вертикаль, кожна горизонталь та кожний квадрат містили всі числа
від 1 до X**2 включно без повторів.

-- квадрат 9х9 (3**2 = 9), який складається з 9 квадратів 3х3.
В кожній вертикалі розміщені різні числа від 1 до 9.
Те саме стосується кожної горизонталі та кожного внутрішнього квадрату.

Дане завдання не має єдиного вірного розв'язку -- ваша функція повинна
повертати результат, який задовольняє умові, за відведений час.

Тести із некоректними даними не проводяться

Приклад вхідних і вихідних даних:
print make_sudoku(1) # [[1]]
print make_sudoku(2) # [[1,2,3,4],
                        [3,4,1,2],
                        [2,1,4,3],
                        [4,3,2,1]]
print make_sudoku(3) # [[3,5,8,1,2,7,6,4,9],
                        [6,7,4,5,8,9,3,2,1],
                        [2,1,9,3,4,6,5,7,8],
                        [9,8,6,7,1,4,2,5,3],
                        [4,3,1,2,6,5,8,9,7],
                        [7,2,5,9,3,8,1,6,4],
                        [1,6,3,4,7,2,9,8,5],
                        [8,9,7,6,5,1,4,3,2],
                        [5,4,2,8,9,3,7,1,6]]
"""
from random import shuffle


def make_sudoku(size):
    f_size = size ** 2
    rez = []
    start_vals = [i for i in range(1, f_size + 1)]
    shuffle(start_vals)
    for i in range(0, size):
        vals = start_vals
        vals = vals[i:] + vals[:i]
        rez.append(vals)
        for j in range(size - 1):
            vals = vals[size:] + vals[:size]
            rez.append(vals)

    return rez

l = make_sudoku(3)
print '----------'
for ii in range(len(l)):
    print l[ii]

print len(l), len(l[0])
